MOCK_DATA = {
    "check_list": [
        {"number": 79990000001},
        {"number": 79990000002},
        {"number": 79990000003},
        {"number": 79990000004},
    ],
    "source": [
        {"Номер телефона": 79990000000},
        {"Номер телефона": 79990000001},
        {"Номер телефона": 79990000002},
        {"Номер телефона": 79990000003},
        {"Номер телефона": 79990000004},
        {"Номер телефона": 79990000005},
        {"Номер телефона": 79990000006},
        {"Номер телефона": 79990000007},
    ],
    "macros": [
        {"num": 79990000000},
        {"num": 79990000005},
        {"num": 79990000007},
        {"num": 79990000008},
    ],
    "expected_checked_source": [
        {"Номер телефона": 79990000000},
        {"Номер телефона": 79990000005},
        {"Номер телефона": 79990000006},
        {"Номер телефона": 79990000007},
    ],
    "expected_filtered_by_macros_source": [
        {"Номер телефона": 79990000000},
        {"Номер телефона": 79990000005},
        {"Номер телефона": 79990000007},
    ],
    "completed": [
        {"Номер телефона": 79990000001},
        {"Номер телефона": 79990000002},
        {"Номер телефона": 79990000003},
        {"Номер телефона": 79990000004},
    ],
}
